Revit 2027 API
BuiltInFailures.StairRampFailures.StairsPathPositionResetWarning Property
 The stairs path doesn't intersect with riser lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsPathPositionResetWarning { get; }
Public Shared ReadOnly Property StairsPathPositionResetWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsPathPositionResetWarning {
	FailureDefinitionId^ get ();
}
static member StairsPathPositionResetWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace